In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv('data/train.csv')
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [3]:
print(titanic.shape)
print(titanic.size)
print(titanic.ndim)
print(titanic.dtypes)

(891, 12)
10692
2
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
titanic.count()
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
index = ['Sex', 'Survived', 'Pclass', 'Age']

for i in index:
    print(titanic[i].value_counts())
    print('==================')

male      577
female    314
Name: Sex, dtype: int64
==================
0    549
1    342
Name: Survived, dtype: int64
==================
3    491
1    216
2    184
Name: Pclass, dtype: int64
==================
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64
==================

In [7]:
titanic[titanic['Sex'] == 'male']['Survived'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [8]:
titanic[titanic['Sex'] == 'female']['Survived'].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [9]:
sex = ['male', 'female']

for i in sex:
    print(i)
    print(titanic[titanic['Sex'] == i]['Survived'].value_counts())
    print("===============================")

male
0    468
1    109
Name: Survived, dtype: int64
===============================
female
1    233
0     81
Name: Survived, dtype: int64
===============================

In [11]:
print(titanic.loc[titanic['Sex'] == 'male','Survived'].value_counts())
print(titanic.loc[titanic['Sex'] == 'female','Survived'].value_counts())

0    468
1    109
Name: Survived, dtype: int64
1    233
0     81
Name: Survived, dtype: int64

In [10]:
pd.crosstab(titanic['Sex'], titanic['Survived'])

Survived    0    1
Sex
female     81  233
male      468  109

In [13]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [31]:
titanic['Age'].max()

80.0

In [32]:
bins = [0, 15, 25, 35, 60, 99,150]
lb = ['미성년자', '청년', '중년', '장년', '노년','None']

In [33]:
cats_s = pd.cut(titanic[titanic['Survived']==1]['Age'], bins, labels=lb)
cats_d = pd.cut(titanic[titanic['Survived']==0]['Age'], bins, labels=lb)

In [34]:
cats_s.fillna(value = 'None', inplace=True)
cats_d.fillna(value = 'None', inplace=True)

In [35]:
cats_s.value_counts()/len(cats_s)

중년      0.242690
장년      0.228070
청년      0.219298
None    0.152047
미성년자    0.143275
노년      0.014620
Name: Age, dtype: float64

In [36]:
cats_d.value_counts()/len(cats_d)

청년      0.260474
None    0.227687
장년      0.213115
중년      0.205829
미성년자    0.061931
노년      0.030965
Name: Age, dtype: float64